MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ32MC101/mcu.h
#define PLLKEN_OFF           0xBFDF
#define PLLKEN_ON            0xBFFF

#define WINDIS_ON            0xBFBF
#define WINDIS_OFF           0xBFFF

#define FWDTEN_OFF           0xBF7F
#define FWDTEN_ON            0xBFFF

#define ICS_PGD3             0xBDFF
#define ICS_PGD2             0xBEFF
#define ICS_PGD1             0xBFFF

#define HPOL_OFF             0xBBFF
#define HPOL_ON              0xBFFF

#define GWRP_ON              0xAFFF
#define GWRP_OFF             0xBFFF

#define GCP_ON               0x9FFF
#define GCP_OFF              0xBFFF



/*
 * Memory Segments Sizes
 */

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define ___RESERVED_BASE 0x100
#define ___RESERVED_LENGTH 0x4

#define __AIVT_BASE 0x104
#define __AIVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x55fc

#define __CONFIG2_BASE 0x57fc
#define __CONFIG2_LENGTH 0x2

#define __CONFIG1_BASE 0x57fe
#define __CONFIG1_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x800

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x800

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x800


/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_C1OUT 1
#define _RPOUT_C2OUT 2
#define _RPOUT_U1TX 3
#define _RPOUT_U1RTS 4
#define _RPOUT_SS1 9
#define _RPOUT_OC1 18
#define _RPOUT_OC2 19
#define _RPOUT_CTPLS 29
#define _RPOUT_C3OUT 30

#endif
